app/controllers/abstracts_controller.rb

SELECT * FROM "abstracts" ORDER BY updated_at DESC LIMIT 1
---
  def set_is_cancer
    @publication = Abstract.include_invalid(params[:id])
    if @publication.is_cancer.blank? or ! @publication.is_cancer