app/controllers/cytoscape_controller.rb

  def investigator_chord
    @title = 'Chord Diagram showing publications between various investigators'
    unless params[:id].blank?
      @investigator = Investigator.find_by_username(params[:id])
---
SELECT * FROM "investigators" WHERE ("investigators"."username" = 'sis997') AND ((investigators.deleted_at is null and investigators.end_date is null)) LIMIT 1

  def investigator_wordle
    @title = 'Wordle for NO ONE BECAUSE THE ID IS INVALID'
    unless params[:id].blank?
      @investigator = Investigator.find_by_username(params[:id])
---
SELECT * FROM "investigators" WHERE ("investigators"."username" = 'sis997') AND ((investigators.deleted_at is null and investigators.end_date is null)) LIMIT 1

  def d3_investigator_chord_data
      #@investigators = @head_node.descendants.sort_by(&:name)
      if (params[:id])
        investigator = Investigator.find_all_by_username(params[:id]).first
---
SELECT * FROM "investigators" WHERE ("investigators"."username" = 'sis997') AND ((investigators.deleted_at is null and investigators.end_date is null))

  def d3_investigator_edge_data
    #@investigators = @head_node.descendants.sort_by(&:name)
    departments = OrganizationalUnit.all
    #investigators = []
    #departments.each {|dep|
    #  dep.primary_or_member_faculty.each {|inv|
    #      investigators << inv
    #    }
    #  }
    investigators = Investigator.all
---
SELECT * FROM "organizational_units"
SELECT * FROM "investigators" WHERE ((investigators.deleted_at is null and investigators.end_date is null))

  def d3_investigator_wordle_data
    words = []
    if (params[:id])
      investigator = Investigator.find_by_username(params[:id])
---
SELECT * FROM "investigators" WHERE ("investigators"."username" = 'sis997') AND ((investigators.deleted_at is null and investigators.end_date is null))